ConnectTest/src/Enums/systemTypes/systemTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>systemTypes</name>
	<enumValues>
		<name>Android</name>
	</enumValues>
	<enumValues>
		<name>iOS</name>
	</enumValues>
	<enumValues>
		<name>Web</name>
	</enumValues>
</mdclass:Enum>

ConnectTest/src/Catalogs/tokens/tokens.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>tokens</name>
  <attributes>
    <name>appType</name>
    <type>
      <types>EnumRef.appTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>lockDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>createDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>systemType</name>
    <comment>Операционная система устройства</comment>
    <type>
      <types>EnumRef.systemTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>user</name>
    <type>
      <types>CatalogRef.users</types>
    </type>
  </attributes>
  <attributes>
    <name>chain</name>
    <type>
      <types>CatalogRef.chain</types>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>timeZone</name>
    <type>
      <types>CatalogRef.timeZones</types>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/Catalogs/users/users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>users</name>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>birthday</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>firstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>userCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>login</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>notSubscriptionEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>notSubscriptionSms</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>secondName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>sex</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>canUpdatePersonalData</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>userType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>lastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>barCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/Catalogs/chain/chain.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>chain</name>
  <attributes>
    <name>currencySymbol</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>brand</name>
    <type>
      <types>EnumRef.brandTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>phoneMask</name>
    <type>
      <types>CatalogRef.phoneMasks</types>
    </type>
  </attributes>
  <attributes>
    <name>loyaltyProgram</name>
    <type>
      <types>EnumRef.loyaltyTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>timeZone</name>
    <type>
      <types>CatalogRef.timeZones</types>
    </type>
  </attributes>
  <tabularSections>
    <name>translation</name>
    <attributes>
      <name>language</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ConnectTest/src/CommonModules/GeneralReuse/Module.bsl
Function УзелСообщенияКОтправке(КаналИнформирования) Export
	Возврат ПланыОбмена.messagesToSend.НайтиПоРеквизиту("informationChannel", КаналИнформирования);	
EndFunction

Function УзелСообщенияПроверкаСтатуса(КаналИнформирования) Export
	Возврат ПланыОбмена.messagesToCheckStatus.НайтиПоРеквизиту("informationChannel", КаналИнформирования);	
EndFunction

Function УзелРегистрацияПользователя(ТипРегистрации) Export
	Возврат ПланыОбмена.usersCheckIn.НайтиПоРеквизиту("ТипРегистрации", ТипРегистрации);	
EndFunction

Function ДанныеАутентификации(ОперационнаяСистема, Сертификат) Export
	Если ОперационнаяСистема = Enums.systemTypes.Android Тогда
		Возврат Сертификат;
	Иначе	
		Возврат ПолучитьОбщийМакет(Сертификат);
	КонецЕсли;
EndFunction

Function checkToken(language, token) Export
	
	answer		= New Structure();
	answer.Insert("token", Catalogs.tokens.EmptyRef());
	answer.Insert("user", Catalogs.users.EmptyRef());
	answer.Insert("userType", "");
	answer.Insert("holding", Catalogs.holdings.EmptyRef());
	answer.Insert("chain", Catalogs.chain.EmptyRef());
	answer.Insert("appType", Enums.appTypes.EmptyRef());
	answer.Insert("systemType", Enums.systemTypes.EmptyRef());
	answer.Insert("timezone", Catalogs.timeZones.EmptyRef());
	answer.Insert("errorDescription", Service.getErrorDescription(language, "userNotIdentified"));		
	
	If ValueIsFilled(token) Then
		
		query = New Query();			
		query.Text	= "ВЫБРАТЬ
		|	ВЗ.token КАК token,
		|	ВЗ.user КАК user,
		|	ВЗ.userType КАК userType,
		|	ВЗ.chain КАК chain,
		|	ВЗ.holding КАК holding,
		|	ВЗ.appType КАК appType,
		|	ВЗ.systemType КАК systemType,
		|	ВЗ.timezone КАК timezone
		|ИЗ
		|	(ВЫБРАТЬ
		|		Токены.Ссылка КАК token,
		|		Токены.user КАК user,
		|		Токены.user.userType КАК userType,
		|		Токены.chain КАК chain,
		|		Токены.holding КАК holding,
		|		Токены.appType КАК appType,
		|		Токены.systemType КАК systemType,
		|		Токены.timeZone КАК timezone,
		|		Токены.lockDate КАК lockDate
		|	ИЗ
		|		Справочник.tokens КАК Токены
		|	ГДЕ
		|		Токены.Ссылка = &token) КАК ВЗ
		|ГДЕ
		|	ВЗ.lockDate = ДАТАВРЕМЯ(1, 1, 1)";
		
		query.SetParameter("token", XMLValue(Type("CatalogRef.tokens"), token));		
		
		queryResult	= query.Execute();		
		
		If Not queryResult.IsEmpty() Then
			selection	= queryResult.Select();
			selection.Next();		
			answer.Insert("token", selection.token);
			answer.Insert("user", selection.user);
			answer.Insert("userType", selection.userType);
			answer.Insert("holding", selection.holding);
			answer.Insert("chain", selection.chain);
			answer.Insert("appType", selection.appType);
			answer.Insert("systemType", selection.systemType);
			answer.Insert("timezone", selection.timezone);
			answer.Insert("errorDescription", Service.getErrorDescription(language, ""));
		EndIf;		
	
	EndIf;
	
	Return answer;
	
EndFunction

Function ПолучитьБазовыйURL() Export
	Возврат  Константы.BaseURL.Получить();	
EndFunction

Function phoneMasksList() Export
	
	array	= New Array();		
	query	= New Query();
	
	query.Text	= "ВЫБРАТЬ
	|	МаскиНомеровТелефонов.CountryCode,
	|	МаскиНомеровТелефонов.Description
	|ИЗ
	|	Справочник.phoneMasks КАК МаскиНомеровТелефонов
	|ГДЕ
	|	Не МаскиНомеровТелефонов.ПометкаУдаления";
	
	selection	= query.Execute().Select();
	
	While selection.Next() Do
		answer	= New Structure();
		answer.Вставить("code", selection.КодСтраны);
		answer.Вставить("mask", selection.Description);		
		array.add(answer);
	EndDo;
		
	Return array;
	
EndFunction
